export default function AboutUs() {
  return (
    <section>
      <h2>ПРО НАС</h2>
      <h3>НАШ ДОСВІД - ВАША БЕЗПЕКА</h3>
      <p>
        Охоронна група компаній «Агенція Безпеки «Альфа Секьюріті» місто Київ,
        працює в сфері безпеки протягом 10 років. Завдяки високому рівню послуг,
        які ми надаємо, постійними клієнтами компанії стало вже більше 3000
        фізичних та юридичних осіб на більше 1000 об’єктах. Ми забезпечуємо
        збереження рухомого і нерухомого майна, робимо все для запобігання
        можливим загрозам безпеці, здоров’ю та життю людини. Також наша агенція
        безпеки займається підбором та установкою сучасних систем безпеки
        різного рівня для обʼєктів , будинків і квартир з подальшим їх
        моніторингом та охороною.
      </p>
    </section>
  );
}
