export default function License() {
  return (
    <section>
      <h2>ЛІЦЕНЗІЇ</h2>
      <ul>
        <li>
          <p>1. Ліцензія МВС України № 1306 від 29.10.2015 року</p>
        </li>
        <li>
          <p>
            2. Ліцензія МВС України, затверджена наказом МВС України № 221 від
            20.03.2018 року “Про видачу ліцензій на провадження охоронної
            діяльності”
          </p>
        </li>
        <li>
          <p>
            3. Ліцензія МНС України, затверджена наказом ДСНС України № 674 від
            25.11.2019 року “Про видачу ліцензій на провадження господарської
            діяльності з надання послуг і виконання робіт з протипожежного
            призначення”
          </p>
        </li>
      </ul>
    </section>
  );
}
