export const ABOUT = [
  {
    id: 1,
    text: "Залежно від запиту клієнта та з урахуванням потенційних ризиків ми розробляємо технічне рішення та на професійному рівні виконуємо інсталяцію й налаштування систем безпеки, проводимо навчання користувачів.",
    title: "МОНТАЖ СИСТЕМИ",
    subtitle: "Встановлення обладнання для охорони",
    icon: "tool",
  },
  {
    id: 2,
    text: "Цілодобовий контроль за станом систем безпеки на об’єкті дозволяє оперативно реагувати на тривоги та своєчасно виявляти поломки або збої в роботі обладнання.",
    title: "МОНІТОРИНГ",
    subtitle: "Постійний контроль ситуації",
    icon: "camera",
  },
  {
    id: 3,
    text: "При отриманні сигналу тривоги про проникнення або пожежу на об’єкт виїжджає група мобільного реагування для запобігання протиправним діям, збереження майна клієнта та усунення ймовірних ризиків.",
    title: "РЕАГУВАННЯ",
    subtitle: "Мінімальний час прибуття",
    icon: "time",
  },
  {
    id: 4,
    text: "Ми проводимо обслуговування систем безпеки та забезпечуємо технічну підтримку кожного об’єкта. У разі виникнення несправностей або збоїв в роботі обладнання, на об’єкт виїжджають фахівці для усунення неполадок.",
    title: "ТЕХНІЧНА ПІДТРИМКА",
    subtitle: "Забезпечення безперебійної роботи систем",
    icon: "headset",
  },
];
