export const PRICES = [
  {
    id: 1,
    title: "«Тривожна сигналізація»",
    specs: [
      "кнопка тривожної сигналізації",
      "моніторинг 24/7",
      "виїзд групи реагування",
      "технічна підтримка",
    ],
  },
  {
    id: 2,
    title: "«Охоронна сигналізація»",
    specs: [
      "захист від проникнення",
      "моніторинг 24/7",
      "виїзд групи реагування",
      "матеріальна відповідальність",
      "технічна підтримка",
    ],
  },
  {
    id: 3,
    title: "«Охоронно-тривожна сигналізація»",
    specs: [
      "кнопка тривожної сигналізації",
      "захист від проникнення",
      "моніторинг 24/7",
      "виїзд групи реагування",
      "матеріальна відповідальність",
      "технічна підтримка",
    ],
  },
  {
    id: 4,
    title: "«Охоронно-пожежна сигналізація»",
    specs: [
      "захист від проникнення",
      "моніторинг 24/7",
      "виїзд групи реагування",
      "матеріальна відповідальність",
      "технічна підтримка",
      "інформування про загоряння",
      "виклик служб ДСНС",
    ],
  },
];
