const ROUTES = [
  {
    id: 1,
    name: "Про нас",
    path: "/about",
    scalable: [],
  },
  {
    id: 2,
    name: "Послуги",
    path: "/services",
    scalable: [
      { id: 1, text: "Моніторинг рухомих об’єктів" },
      {
        id: 2,
        text: "Проектування, монтаж та обслуговування систем контролю доступу",
      },
      {
        id: 3,
        text: "Проектування, монтаж і підключення до моніторингу ПЦС охоронної, тривожної та протипожежної систем сигналізації",
      },
      {
        id: 4,
        text: "Фізична охорона об’єктів різних форм власності",
      },
      {
        id: 5,
        text: "Моніторинг і охорона рухомих і нерухомих обʼєктів різних форм власності",
      },
    ],
  },
  {
    id: 3,
    name: "Тарифи",
    path: "/prices",
    scalable: [
      { id: 1, text: "«Тривожна сигналізація»" },
      {
        id: 2,
        text: "«Охоронна сигналізація»",
      },
      {
        id: 3,
        text: "«Охоронно-тривожна сигналізація»",
      },
      {
        id: 4,
        text: "«Охоронно-пожежна сигналізація»",
      },
    ],
  },
  {
    id: 4,
    name: "Акції",
    path: "/discounts",
    scalable: [],
  },

  {
    id: 5,
    name: "Контакти",
    path: "/contacts",
    scalable: [],
  },
];

export default ROUTES;
