export const SERVICES = [
  {
    id: 1,
    title:
      "Моніторинг і охорона рухомих і нерухомих обʼєктів різних форм власності",
  },
  {
    id: 2,
    title: "Фізична охорона об’єктів різних форм власності",
  },
  {
    id: 3,
    title:
      "Проектування, монтаж і підключення до моніторингу ПЦС охоронної, тривожної та протипожежної систем сигналізації",
  },
  {
    id: 4,
    title: "Проектування, монтаж та обслуговування систем контролю доступу",
  },
  {
    id: 5,
    title: "Моніторинг рухомих об’єктів",
  },
];
